{"_id":{"$oid":"5eefa11df61b2a44ee0a3818"},"ISBN":1102,"title":"NASCAR boss condemns the 'jackass' flying a Confederate flag over Talladega before Sunday's race","author":"Tadd Haislop","description":"<p>The banner flying over the track included the words \"Defund NASCAR.\"</p>","pub_date":"Sun, 21 June 2020 13:50:35 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3819"},"ISBN":1103,"title":"Brett Favre compares Colin Kaepernick to Pat Tillman: 'We regard him as a hero'","author":"Jordan Heck","description":"<p>\"It's not easy for a guy his age ... to stop something that you've always dreamed of doing, and put it on hold, maybe forever, for something that you believe in.\"</p>","pub_date":"Sun, 21 June 2020 13:29:27 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a381a"},"ISBN":1104,"title":"Rudy Gobert shares political post from wrong Serena Williams, gets roasted again","author":"Dan Bernstein","description":"<p>Gobert's rough 2020 hit another bump Saturday night.</p>","pub_date":"Sun, 21 June 2020 12:41:48 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a381b"},"ISBN":1105,"title":"The Currys, Rivers, Thompsons and other famous NBA fathers and sons","author":"Mike DeCourcy","description":"<p>To celebrate Father’s Day, we look at a dozen of the most prominent active father-son duos (or trios, as the case may be).</p>","pub_date":"Sun, 21 June 2020 10:30:03 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a381c"},"ISBN":1106,"title":"LSU players' COVID-19 quarantine reportedly result of outside contacts","author":"Tom Gatto","description":"<p>The university says its safety protocols are working but can't guard against interactions outside the football facility.</p>","pub_date":"Sun, 21 June 2020 10:05:59 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a381d"},"ISBN":1107,"title":"Donald Trump campaign rally does not fill Tulsa arena, and Twitter has sports attendance jokes","author":"Tom Gatto","description":"<p>The BOK Center in Tulsa, Okla., seats about 19,000 people.</p>","pub_date":"Sun, 21 June 2020 09:02:37 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a381e"},"ISBN":1108,"title":"Who won the Belmont Stakes in 2020? Full results, finish order & highlights from the race","author":"Dan Bernstein","description":"<p>Sporting News tracked live updates and highlights from the 2020 Belmont Stakes. Follow here for complete results from the first leg of horse racing's Triple Crown.</p>","pub_date":"Sun, 21 June 2020 09:02:59 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a381f"},"ISBN":1109,"title":"What channel is NASCAR on today? TV schedule, start time for Talladega race","author":"Tadd Haislop","description":"<p>Here's a complete guide to watching today's NASCAR race at Talladega Superspeedway, including the TV channel and start time.</p>","pub_date":"Sun, 21 June 2020 08:53:54 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3820"},"ISBN":1110,"title":"Ken Griffey Jr. was just as 'cool' then as Patrick Mahomes is now","author":"Bill Bender","description":"<p>Ken Griffey Jr. was the coolest athlete of his generation, and it resembles the pull Patrick Mahomes II has on the NFL now.</p>","pub_date":"Sun, 21 June 2020 10:44:57 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3821"},"ISBN":1111,"title":"NASCAR lineup at Talladega: Starting order, pole for Sunday's race without qualifying","author":"Tadd Haislop","description":"<p>The starting lineup and pole for Sunday's NASCAR race at Talladega Superspeedway were set by a random draw. Here are the results.</p>","pub_date":"Sun, 21 June 2020 09:27:57 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3822"},"ISBN":1112,"title":"What time does the NASCAR race start today? Schedule, TV channel for Talladega race","author":"Tadd Haislop","description":"<p>NASCAR continues its modified 2020 schedule today with a race at Talladega Superspeedway. Here's everything to know about Sunday's race, including the start time and TV channel.</p>","pub_date":"Sun, 21 June 2020 08:35:18 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3823"},"ISBN":1113,"title":"Odds for NASCAR race at Talladega: Expert picks & favorites to win Sunday's Cup Series race","author":"Tadd Haislop","description":"<p>Here are the complete odds to win Sunday's NASCAR Cup Series race at Talladega Superspeedway.</p>","pub_date":"Sun, 21 June 2020 08:35:40 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3824"},"ISBN":1114,"title":"New NASCAR rules package at Talladega: Explaining the changes after Ryan Newman's Daytona crash","author":"Tadd Haislop","description":"<p>NASCAR is trying to slow down the cars and prevent tandem drafting in an effort to avoid a Newman-like crash at Talladega.</p>","pub_date":"Sun, 21 June 2020 08:34:21 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3825"},"ISBN":1115,"title":"Jurgen Klopp: Not possible for Liverpool to replicate Manchester United's Premier League dominance","author":"Sporting News","description":"<p>The Reds boss can't see his side being as successful with competition between teams fiercer than ever</p>","pub_date":"Sun, 21 June 2020 00:31:37 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3826"},"ISBN":1116,"title":"Virgil van Dijk says Premier League title win can take some Liverpool players to 'next level'","author":"Sporting News","description":"<p>The Dutch defender believes more silverware is just what some of his teammates need to shine even brighter</p>","pub_date":"Sun, 21 June 2020 00:21:44 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3827"},"ISBN":1117,"title":"Cornerman defends ignoring Max Rohskopf's pleas to 'call' UFC fight","author":"Tom Gatto","description":"<p>Robert Drysdale didn't believe his \"champion\" fighter was hurt badly enough to stop the bout.</p>","pub_date":"Sat, 20 June 2020 23:05:02 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3828"},"ISBN":1118,"title":"Nick Watney's contacts test negative; Justin Thomas calls Hilton Head an 'absolute zoo'","author":"Sporting News","description":"<p>\"No offense to Hilton Head, but they're seeming to not take it very seriously,\" Thomas said of people in the South Carolina ocean town.</p>","pub_date":"Sat, 20 June 2020 17:15:12 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3829"},"ISBN":1119,"title":"Addison Russell could eventually win KBO MVP after getting contract in Korea","author":"Dan Bernstein","description":"<p>The Kiwoom Heroes reportedly signed Russell on Friday.</p>","pub_date":"Sat, 20 June 2020 14:27:54 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a382a"},"ISBN":1120,"title":"The Mannings, Longs, Shulas and other famous NFL fathers and sons, past and present","author":"Vinnie Iyer","description":"<p>The NFL has long been a family affair. Here are some of the father-son duos who have graced the gridiron.</p>","pub_date":"Sat, 20 June 2020 14:27:22 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a382b"},"ISBN":1121,"title":"Lakers owner Jeanie Buss shares vile racist letter addressed to her","author":"Joe Rivera","description":"<p>Buss called for her white friends to help fight against racism.</p>","pub_date":"Sat, 20 June 2020 13:40:48 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a382c"},"ISBN":1122,"title":"Premier League schedule: What games are on today? TV channels, times to watch EPL soccer in USA","author":"Sporting News","description":"<p>Here's everything you need to know about the return of the Premier League, including a full schedule for Matchday 30 and how to watch the matches in the United States.</p>","pub_date":"Sat, 20 June 2020 08:50:27 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a382d"},"ISBN":1123,"title":"How to watch Premier League in the USA: Full TV schedule for 2020 EPL season on NBC channels","author":"Sporting News","description":"<p>Here's a guide to watching Premier League soccer in the United States, including a complete schedule with start times and channels for the rest of the 2020 EPL season.</p>","pub_date":"Sat, 20 June 2020 08:50:39 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a382e"},"ISBN":1124,"title":"What time is the Belmont Stakes? Post time, TV channel, horses & more to watch 2020 race","author":"Vinnie Iyer","description":"<p>Here is everything to know about the 2020 Belmont Stakes, including the post time, TV channel, odds and post positions for each horse.</p>","pub_date":"Sat, 20 June 2020 08:47:57 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a382f"},"ISBN":1125,"title":"Belmont Stakes horses, odds, expert picks & more for first leg of 2020 Triple Crown","author":"Vinnie Iyer","description":"<p>Here's everything to know about the horses in the 2020 Belmont Stakes, including updated betting odds and picks from our expert.</p>","pub_date":"Sat, 20 June 2020 11:42:31 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3830"},"ISBN":1126,"title":"Belmont Stakes prop bets, odds and picks for the 2020 Triple Crown race","author":"Vinnie Iyer","description":"<p>Here's a complete guide to the 2020 Belmont Stakes prop bets, including odds and our picks for each.</p>","pub_date":"Sat, 20 June 2020 08:25:53 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3831"},"ISBN":1127,"title":"Belmont Stakes post positions: Full draw & odds for the 2020 Triple Crown race","author":"Tadd Haislop","description":"<p>Based on post positions for the 2020 Belmont Stakes, the favorite for Saturday's race is at a statistical disadvantage.</p>","pub_date":"Sat, 20 June 2020 08:25:26 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3832"},"ISBN":1128,"title":"Triple Crown schedule 2020: Here are new dates for the Kentucky Derby, Preakness, Belmont horse races","author":"Vinnie Iyer","description":"<p>The Triple Crown schedule for 2020 looks much different after postponements due to the COVID-19 pandemic.</p>","pub_date":"Sat, 20 June 2020 08:24:17 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3833"},"ISBN":1129,"title":"Belmont Stakes payout breakdown: How much prize money will the winner get in 2020?","author":"Dan Bernstein","description":"<p>While money is slightly tighter in 2020, the Belmont Stakes will still reward top finishers in a big way this year.</p>","pub_date":"Sat, 20 June 2020 08:24:32 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3834"},"ISBN":1130,"title":"23 Clemson football players test positive for COVID-19","author":"Sporting News","description":"<p>While there were 28 positive tests for coronavirus, Clemson said 23 of those were football players.</p>","pub_date":"Sat, 20 June 2020 00:46:43 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3835"},"ISBN":1131,"title":"Maybe Theo Epstein can help solve the Bears' kicker shortcomings","author":"Dan Bernstein","description":"<p>The Cubs president has a surprisingly strong leg.</p>","pub_date":"Fri, 19 June 2020 16:46:34 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3836"},"ISBN":1132,"title":"Lightning, Blue Jays halt training in Florida after multiple positive COVID-19 tests","author":"Tadd Haislop","description":"<p>The coronavirus outbreak in Florida apparently is impacting the sports world, too.</p>","pub_date":"Fri, 19 June 2020 15:37:09 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3837"},"ISBN":1133,"title":"How the NBA's seemingly helpful smart rings have complex implications for player rights","author":"Dan Bernstein","description":"<p>Athletes should use the introduction of the Oura ring as a chance to consider the future of wearable technology.</p>","pub_date":"Fri, 19 June 2020 15:32:42 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3838"},"ISBN":1134,"title":"Former owners of Redskins, Twins have statues removed for racist history","author":"Sporting News","description":"<p>Statues of Calvin Griffith and George Preston Marshall have been removed from the grounds at Target Field and RFK Stadium.</p>","pub_date":"Fri, 19 June 2020 15:15:43 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3839"},"ISBN":1135,"title":"Black Players Coalition of MLS forms as players unite to combat racism","author":"Sporting News","description":"<p>A group featuring players across the league have unified in an effort to address inequality in the sport</p>","pub_date":"Fri, 19 June 2020 14:30:26 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a383a"},"ISBN":1136,"title":"ESPN's Ryan Clark breaks down on 'Get Up' while discussing racism directed at his son","author":"Tadd Haislop","description":"<p>Jordan Clark and a couple Arizona State teammates said they were called the N-word by a Whataburger customer while waiting for their food.</p>","pub_date":"Fri, 19 June 2020 14:22:50 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a383b"},"ISBN":1137,"title":"Christian McCaffrey teams with dad to give Father's Day surprise to military members","author":"Bill Bender","description":"<p>Christian McCaffrey continues his work with USAA, and he gave a father-daughter military combo a Father's Day weekend surprise.</p>","pub_date":"Fri, 19 June 2020 11:15:56 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a383c"},"ISBN":1138,"title":"Mississippi State, Ole Miss support SEC pressure for a new state flag: 'It is past time for change'","author":"Tadd Haislop","description":"<p>The state flag of Mississippi is the only one in the United States that features the Confederate symbol.</p>","pub_date":"Fri, 19 June 2020 10:38:40 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a383d"},"ISBN":1139,"title":"Titus O'Neil on his Muhammad Ali Award nomination, addressing social issues in WWE and mission to give back","author":"Andreas Hale","description":"<p>WWE Superstar Titus O'Neil discusses being a finalist for the Muhammad Ali Award, Randy Orton coming around to support Black Lives Matter and why his job will never define who he is.</p>","pub_date":"Fri, 19 June 2020 10:33:59 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a383e"},"ISBN":1140,"title":"Why Florida banned its 'Gator Bait' cheer amid movement against racial injustice","author":"Tadd Haislop","description":"<p>There is disturbing racist imagery associated with \"Gator Bait,\" school officials said in a letter banning the popular tradition at UF sporting events.</p>","pub_date":"Fri, 19 June 2020 11:22:35 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a383f"},"ISBN":1141,"title":"From Blake Snell to Fay Vincent, those closest to MLB continue to misunderstand fans' relationship to game","author":"Mike DeCourcy","description":"<p>If MLB wishes to dismiss the threats from fans to abandon the game for good if there is no clear solution to the 2020 season, or no solution soon, it does so at its own peril.</p>","pub_date":"Fri, 19 June 2020 09:42:25 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3840"},"ISBN":1142,"title":"Donald Trump: Drew Brees 'caved under the PR pressure' by changing stance on kneeling","author":"Peter Hanson","description":"<p>Saints quarterback Drew Brees will come to regret his change of stance on kneeling during the national anthem, says Donald Trump.</p>","pub_date":"Fri, 19 June 2020 07:58:03 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3841"},"ISBN":1143,"title":"Mavericks owner Mark Cuban hopes NBA players are allowed to kneel during anthem","author":"Sporting News","description":"<p>NBA players should be allowed to kneel during the national anthem, Dallas Mavericks owner Mark Cuban said.</p>","pub_date":"Fri, 19 June 2020 07:55:57 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3842"},"ISBN":1144,"title":"Fortnite Catty Corner vault location: How to complete the Chapter 2, Season 3 challenge","author":"Joe Rivera","description":"<p>Here's everything to know about finding and opening the Catty Corner vault in Fortnite Chapter 2, Season 3.</p>","pub_date":"Fri, 19 June 2020 07:36:16 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3843"},"ISBN":1145,"title":"Where is Homely Hills in Fortnite? How to find gnomes in the Chapter 2, Season 3 map","author":"Joe Rivera","description":"<p>Here's a complete guide to Homely Hills in Fortnite, where you can find gnomes to complete the Chapter 2, Season 3 challenge.</p>","pub_date":"Fri, 19 June 2020 07:35:40 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3844"},"ISBN":1146,"title":"Fortnite map, Battle Pass, mythic weapons, Aquaman skin & more to know about Chapter 2, Season 3","author":"Jordan Heck","description":"<p>Here's a complete guide to the new Fortnite map, including how to get mythic weapons and the Aquaman skin, unlocking Battle Pass levels and more to master Chapter 2, Season 3.</p>","pub_date":"Fri, 19 June 2020 07:35:51 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3845"},"ISBN":1147,"title":"Fortnite has sharks you can ride and loot, here's how to do it","author":"Jordan Heck","description":"<p>You can ride sharks at the start of Fortnite Chapter 2, Season 3.</p>","pub_date":"Fri, 19 June 2020 07:35:28 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3846"},"ISBN":1148,"title":"Fortnite has cars in Chapter 2, Season 3, but where are they?","author":"Jordan Heck","description":"<p>The Fortnite Chapter 2, Season 3 trailer features cars, leading gamers to wonder if they can drive them.</p>","pub_date":"Fri, 19 June 2020 07:36:04 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3847"},"ISBN":1149,"title":"When can Liverpool win the Premier League this season?","author":"Sporting News","description":"<p>The COVID-19 outbreak delayed Liverpool's Premier League celebrations, but with games restarting in June, when can they lift the title?</p>","pub_date":"Fri, 19 June 2020 07:30:32 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3848"},"ISBN":1150,"title":"'Star Wars Squadrons' release details: Date, price, gameplay trailer for new EA title","author":"Dan Bernstein","description":"<p>EA created buzz with its announcement Thursday afternoon.</p>","pub_date":"Thu, 18 June 2020 20:32:41 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3849"},"ISBN":1151,"title":"Jamal Adams sounds done with the Jets in Instagram post, reportedly requests trade","author":"Joe Rivera","description":"<p>The All-Pro safety had some more choice words for his organization on Thursday followed by a report that he has formally requested a trade out of New York.</p>","pub_date":"Thu, 18 June 2020 17:04:15 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a384a"},"ISBN":1152,"title":"Why 'Hard Knocks' in 2020 sounds like a bad idea, especially with boring Rams and Chargers","author":"Vinnie Iyer","description":"<p>Remaining hard-and-fast with \"Hard Knocks\" during a pandemic seems entirely NFL-serving and unnecessary.</p>","pub_date":"Thu, 18 June 2020 21:20:51 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a384b"},"ISBN":1153,"title":"Deebo Samuel injury update: 49ers offense takes a hit with WR's broken foot","author":"Tadd Haislop","description":"<p>The broken foot means Samuel likely will not be in the lineup when San Francisco begins its 2020 season.</p>","pub_date":"Thu, 18 June 2020 15:56:00 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a384c"},"ISBN":1154,"title":"Chief medical officer says NFL will be ‘flexible and adaptable’ after Anthony Fauci casts doubts over season","author":"Sporting News","description":"<p>NFL chief medical officer Dr. Allen Sills knows the league faces a tough task ensuring the season can start safely.</p>","pub_date":"Thu, 18 June 2020 15:15:22 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a384d"},"ISBN":1155,"title":"Panthers prepared to get 'butts kicked' after offseason roster overhaul","author":"Dan Bernstein","description":"<p>Defensive coordinator Phil Snow set a low bar for the 2020 season.</p>","pub_date":"Thu, 18 June 2020 14:25:24 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a384e"},"ISBN":1156,"title":"Texas linebacker: 'I do not feel comfortable' playing for Longhorns after speaking out on race","author":"Dan Bernstein","description":"<p>Juwan Mitchell said fans only care about on-field success and not the feelings of individuals who represent the Longhorns.</p>","pub_date":"Thu, 18 June 2020 13:57:28 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a384f"},"ISBN":1157,"title":"Fact-checking Donald Trump's comments about Colin Kaepernick's NFL career","author":"Tadd Haislop","description":"<p>Trump was notably vague about how Kaepernick's career played out, so here is a quick refresher.</p>","pub_date":"Thu, 18 June 2020 12:22:13 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3850"},"ISBN":1158,"title":"Dominique Wilkins wants to make a comeback — as an All Elite Wrestling manager","author":"Joe Rivera","description":"<p>The \"Human Highlight Reel\" wants to take his talents from the court to the squared circle.</p>","pub_date":"Thu, 18 June 2020 11:30:47 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3851"},"ISBN":1159,"title":"Positive COVID-19 tests among Cowboys, Texans are giving NFL coaches pause on 2020 season","author":"Tadd Haislop","description":"<p>Training camp is right around the corner, and the clock is ticking for the NFL to establish comprehensive health and safety protocols.</p>","pub_date":"Thu, 18 June 2020 09:43:33 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3852"},"ISBN":1160,"title":"Madden 21 cover: The inside story on why EA Sports switched looks","author":"Jordan Heck","description":"<p>EA Sports wasn't able to do its typical cover shoot with Lamar Jackson, so designers had to get creative.</p>","pub_date":"Thu, 18 June 2020 07:48:08 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3853"},"ISBN":1161,"title":"Madden 21 release date, new features & more things we learned from EA Sports' reveal trailer","author":"Jordan Heck","description":"<p>EA Sports released the official Madden 21 gameplay trailer, our first look into what we can expect from the latest edition in video game franchise.</p>","pub_date":"Thu, 18 June 2020 07:47:50 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3854"},"ISBN":1162,"title":"Ex-NFL player repeats 31-year-old claim that Mike Gundy used N-word while playing for Oklahoma State","author":"Tom Gatto","description":"<p>Alfred Williams said he \"won't back down\" from speaking about what he said happened in 1989.</p>","pub_date":"Thu, 18 June 2020 07:31:20 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3855"},"ISBN":1163,"title":"The 100 most expensive football transfers of all time","author":"Sporting News","description":"<p>The big-money moves just keep on coming with Chelsea completing the signing of Timo Werner from RB Leipzig</p>","pub_date":"Thu, 18 June 2020 06:15:31 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3856"},"ISBN":1164,"title":"Panthers ask, 'Who is the franchise GOAT?' Fans ask, 'Why isn't Cam Newton an option?'","author":"Tom Gatto","description":"<p>The team's former MVP and Super Bowl quarterback was conspicuous by his absence from the Twitter poll.</p>","pub_date":"Wed, 17 June 2020 22:25:33 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3857"},"ISBN":1165,"title":"Broncos' Kareem Jackson tests positive for COVID-19","author":"Sporting News","description":"<p>The Denver safety is the latest NFL player to contract the coronavirus disease.</p>","pub_date":"Wed, 17 June 2020 21:18:55 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3858"},"ISBN":1166,"title":"Cardinals QB Kyler Murray says he'll kneel during national anthem","author":"Sporting News","description":"<p>Arizona's second-year starter says that, as a black quarterback, he bears a responsibility to be more vocal on issues such as social justice and race relations than he was as a rookie.</p>","pub_date":"Wed, 17 June 2020 20:19:17 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3859"},"ISBN":1167,"title":"Donald Trump: Colin Kaepernick should get another shot at an NFL job if he can still play","author":"Tom Gatto","description":"<p>The president said the former 49ers quarterback \"has to play well.\"</p>","pub_date":"Wed, 17 June 2020 23:53:39 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a385a"},"ISBN":1168,"title":"Sheffield United baffled by Hawk-Eye goal-line technology failure at Aston Villa","author":"Sporting News","description":"<p>The Blades were denied a win because goal-line technology was obstructed, much to their manager's frustration</p>","pub_date":"Wed, 17 June 2020 17:46:21 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a385b"},"ISBN":1169,"title":"Eric Garcia injury mars near-perfect day for Manchester City against Arsenal","author":"Sporting News","description":"<p>The Spanish defender was stretchered off after a wince-inducing collision with Blues goalkeeper Ederson at Etihad Stadium</p>","pub_date":"Wed, 17 June 2020 17:32:18 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a385c"},"ISBN":1170,"title":"Every Aston Villa, Sheffield United player kneeled before Premier League restart in support for Black Lives Matter","author":"Mike DeCourcy","description":"<p>None of the 22 players on the field were American, but the movement reignited by the killing of George Floyd last month obviously has superseded national boundaries.</p>","pub_date":"Wed, 17 June 2020 13:58:03 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a385d"},"ISBN":1171,"title":"Champions League 2020 tournament: Where & when will matches take place?","author":"Sporting News","description":"<p>The knockout stage of Europe's premier club competition will have an unusual dynamic, with a super tournament planned</p>","pub_date":"Wed, 17 June 2020 13:19:07 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a385e"},"ISBN":1172,"title":"Champions League set to restart in August as Lisbon plays host to remainder of tournament","author":"Sporting News","description":"<p>UEFA has announced the remainder of the knockouts will be completed in a single-leg format, as well as confirming plans for the 2020-21 campaign.</p>","pub_date":"Wed, 17 June 2020 13:15:42 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a385f"},"ISBN":1173,"title":"The Chargers are officially interested in signing Colin Kaepernick","author":"Tadd Haislop","description":"<p>Anthony Lynn has not spoken with Kaepernick, but the coach confirmed the 32-year-old would be on the team's workout list should Los Angeles decide to sign another quarterback.</p>","pub_date":"Wed, 17 June 2020 13:42:43 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3860"},"ISBN":1174,"title":"Virginia changes sword handles in its logo because of reference to slavery","author":"Jordan Heck","description":"<p>\"There was no intent to cause harm, but we did, and for that I apologize to those who bear the pain of slavery in our history.\"</p>","pub_date":"Wed, 17 June 2020 12:41:06 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3861"},"ISBN":1175,"title":"A new 'Pokemon Snap' game is coming to Nintendo Switch, and Twitter is freaking out about it","author":"Joe Rivera","description":"<p>A sequel almost two decades in the making is coming to the Nintendo Switch.</p>","pub_date":"Wed, 17 June 2020 11:34:59 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3862"},"ISBN":1176,"title":"If MLB loses the 2020 season, a salary cap should be part of its vision for the future","author":"Mike DeCourcy","description":"<p>Baseball can at least use a nixed year as an opportunity fix its woefully short supply of competition.</p>","pub_date":"Wed, 17 June 2020 11:16:11 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3863"},"ISBN":1177,"title":"Oklahoma State players refute Doug Gottlieb's report about their demands of coach Mike Gundy","author":"Tadd Haislop","description":"<p>\"This isn't the sincere objective we're trying to achieve,\" one Cowboys player tweeted in response to the Fox Sports radio host's tweet.</p>","pub_date":"Wed, 17 June 2020 10:34:52 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3864"},"ISBN":1178,"title":"LaMelo Ball fails in bid to buy his former Australian basketball team","author":"Sporting News","description":"<p>A consortium including former Philadelphia 76ers general manager Bryan Colangelo beat LaMelo Ball in a bid to buy the Illawarra Hawks.</p>","pub_date":"Wed, 17 June 2020 10:00:15 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3865"},"ISBN":1179,"title":"Jimmy Garoppolo's reaction to the 49ers trying to sign Tom Brady is peak Jimmy Garoppolo","author":"Tadd Haislop","description":"<p>John Lynch and Kyle Shanahan were surprisingly honest about their interest in Brady, but Garoppolo's demeanor made it easy for them.</p>","pub_date":"Wed, 17 June 2020 09:24:02 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3866"},"ISBN":1180,"title":"Premier League’s new five substitute rule, explained: Why teams aren’t restricted to just three changes in 2020 ","author":"Sporting News","description":"<p>What is the new rule change and how will it work? England's top flight joins a number of Europe's other leagues in adapting post-coronavirus.</p>","pub_date":"Wed, 17 June 2020 08:22:33 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3867"},"ISBN":1181,"title":"Five things to watch as Premier League returns to work on completing 2019-20 season","author":"Mike DeCourcy","description":"<p>If Liverpool’s victory is an inevitability, what’s compelling about the return of the Premier League? We're glad you asked.</p>","pub_date":"Wed, 17 June 2020 08:03:22 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3868"},"ISBN":1182,"title":"A lonely Premier League title for Liverpool will be 'odd,' but so much better than a 'null and void' season","author":"Mike DeCourcy","description":"<p>With the restart of the Premier League season, the Liverpool fan base, which stretches far beyond England, is eager to see its club finally end its championship drought.</p>","pub_date":"Thu, 18 June 2020 08:58:48 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a3869"},"ISBN":1183,"title":"Yes, Joey Logano tried to hold up Chase Elliott at Homestead: 'You cost me a win, I cost you a win'","author":"Tadd Haislop","description":"<p>Logano confirmed to SN he had the Bristol wreck in mind when he tried to keep Elliott from winning Sunday at Homestead.</p>","pub_date":"Wed, 17 June 2020 07:38:10 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a386a"},"ISBN":1184,"title":"NASCAR driver who quit due to Confederate flag ban says he wasn't defending Confederate flag","author":"Jordan Heck","description":"<p>\"In no way shape or form was I defending the Confederate flag.\"</p>","pub_date":"Wed, 17 June 2020 07:38:21 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a386b"},"ISBN":1185,"title":"Madden 21 trailer leaves fans feeling 'underwhelmed' in first reactions to gameplay","author":"Jordan Heck","description":"<p>EA Sports released the Madden 21 trailer with extended gameplay footage, but fans aren't too excited by it.</p>","pub_date":"Wed, 17 June 2020 07:30:34 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a386c"},"ISBN":1186,"title":"Colin Kaepernick's six best fits for a potential NFL return, from Chiefs to Titans","author":"Vinnie Iyer","description":"<p>This could be Colin Kaepernick's best shot to play in the NFL since becoming a free agent in 2017. Here are the situations that would make the most sense for his comeback.</p>","pub_date":"Wed, 17 June 2020 07:28:20 -0400"}
{"_id":{"$oid":"5eefa11df61b2a44ee0a386d"},"ISBN":1187,"title":"Fortnite Doomsday event: Here's what happened ahead of Season 3 start","author":"Jordan Heck","description":"<p>Fortnite's Doomsday event finally took place, and we explain what happened here.</p>","pub_date":"Wed, 17 June 2020 07:27:18 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab063"},"ISBN":1101,"title":"NASCAR at Talladega results: Ryan Blaney wins dramatic Geico 500; Bubba Wallace falls just short","author":"Dan Bernstein","description":"<p>Sporting News tracked live lap-by-lap updates and highlights from Monday's NASCAR race at Talladega. Follow here for complete results from the Geico 500.</p>","pub_date":"Mon, 22 June 2020 20:16:52 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab064"},"ISBN":1102,"title":"Cowboys QB Dak Prescott signs $31.4M franchise tender","author":"Sporting News","description":"<p>The Cowboys now have until July 15 to work out a long-term deal with their starting quarterback.</p>","pub_date":"Mon, 22 June 2020 18:55:36 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab065"},"ISBN":1103,"title":"Nick Kyrgios slams 'boneheaded' Novak Djokovic-led Adria Tour event","author":"Jordan Greer","description":"<p>The sudden end to the most recent leg of the Adria Tour didn't surprise Nick Kyrgios.</p>","pub_date":"Mon, 22 June 2020 16:34:09 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab066"},"ISBN":1104,"title":"'White lives matter' banner flies above Premier League stadium, outraging soccer fans","author":"Sporting News","description":"<p>The banner was towed by plane over the Etihad on Monday amid ongoing displays for racial equality, causing Burnley F.C. to threaten lifetime bans to those responsible.</p>","pub_date":"Mon, 22 June 2020 16:19:07 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab067"},"ISBN":1105,"title":"NASCAR drivers walk in solidarity with Bubba Wallace in emotional pre-race moment","author":"Joe Rivera","description":"<p>NASCAR is standing behind its only Black driver after a No. 43 crewmember discovered a noose hanging inside the team garage at Talladega Superspeedway on Sunday.</p>","pub_date":"Mon, 22 June 2020 15:58:08 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab068"},"ISBN":1106,"title":"Ninja, Shroud both free agents after Microsoft shuts down Mixer; Twitter adds jokes","author":"Joe Rivera","description":"<p>Ninja and Shroud are free to move to a new service.</p>","pub_date":"Mon, 22 June 2020 15:07:30 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab069"},"ISBN":1107,"title":"Ryan Anderson reportedly said he'll have played the NFL wrong if he can remember his grandkids' names","author":"Jordan Heck","description":"<p>A story told by a former teammate of Ryan Anderson involves a disturbing quote.</p>","pub_date":"Mon, 22 June 2020 14:36:07 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab06a"},"ISBN":1108,"title":"FBI, NASCAR investigating noose hanging in Bubba Wallace's garage stall at Talladega","author":"Tom Gatto","description":"<p>The Cup Series' lone Black driver has been working to educate NASCAR drivers about racial justice issues. He called the noose report a \"despicable act of racism.\"</p>","pub_date":"Mon, 22 June 2020 13:37:02 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab06b"},"ISBN":1109,"title":"When will the NBA return in 2020? Key dates, schedule & more to know about season restart in Orlando","author":"Jordan Greer","description":"<p>Here's everything we know about the NBA's return and what to expect for the rest of the 2019-20 season.</p>","pub_date":"Mon, 22 June 2020 11:32:15 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab06c"},"ISBN":1110,"title":"Richard Petty to make appearance at Talladega to offer support for Bubba Wallace","author":"Joe Rivera","description":"<p>Petty, 82, will make his first appearance at a race since the COVID-19 pandemic took hold of NASCAR and the greater sports world.</p>","pub_date":"Mon, 22 June 2020 12:21:06 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab06d"},"ISBN":1111,"title":"Fortnite removes police cars in apparent response to Black Lives Matter movement","author":"Jordan Heck","description":"<p>Police cars in \"Fortnite\" can no longer be seen in game.</p>","pub_date":"Mon, 22 June 2020 11:18:53 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab06e"},"ISBN":1112,"title":"Jamal Adams 'trying' to force trade to Cowboys, putting Jets in impossible situation","author":"Joe Rivera","description":"<p>The All Pro safety wants out of New York, but that's not necessarily an easy thing.</p>","pub_date":"Mon, 22 June 2020 09:48:27 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab06f"},"ISBN":1113,"title":"Former Mixer employee accuses management of racism, causing top streamers to leave","author":"Jordan Heck","description":"<p>Streamers have announced a delay in their streams following racial allegations from a former Mixer employee.</p>","pub_date":"Mon, 22 June 2020 14:45:36 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab070"},"ISBN":1114,"title":"College football 2020: Preseason top 25 rankings, bowl projections, All-Americans and more","author":"Bill Bender","description":"<p>Sporting News is preparing for the 2020 college football season, and we have all the offseason content you need here to get ready.</p>","pub_date":"Mon, 22 June 2020 09:39:21 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab071"},"ISBN":1115,"title":"College football coaches facing hottest seats, most pressure in 2020","author":"Bill Bender","description":"<p>There is a difference between facing pressure, which comes with the expectations of winning at the big-time programs, and the hot seat — which means you might be looking for a new job if you don't win now.</p>","pub_date":"Mon, 22 June 2020 09:09:11 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab072"},"ISBN":1116,"title":"ESPN's Marty Smith expresses frustration after a noose was found in Bubba Wallace’s garage","author":"Jordan Heck","description":"<p>\"I am so sorry that we even have to have this discussion tonight.”</p>","pub_date":"Mon, 22 June 2020 08:43:29 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab073"},"ISBN":1117,"title":"OAN makes it tougher for Mike Gundy to cut ties amid Oklahoma State football controversy","author":"Dan Bernstein","description":"<p>The far-right station called out Oklahoma State coach Mike Gundy and star Chuba Hubbard at a rally for Donald Trump in Tulsa, Okla.</p>","pub_date":"Mon, 22 June 2020 11:08:07 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab074"},"ISBN":1118,"title":"Ken Griffey Jr. tells a story of why he never considered playing for the Yankees","author":"Tom Gatto","description":"<p>It all goes back to when his dad was playing for the Bombers, Billy Martin was the manager and George Steinbrenner owned the team.</p>","pub_date":"Mon, 22 June 2020 07:55:18 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab075"},"ISBN":1119,"title":"Who won the Belmont Stakes in 2020? Full results, finish order & highlights from the race","author":"Dan Bernstein","description":"<p>Sporting News tracked live updates and highlights from the 2020 Belmont Stakes. Follow here for complete results from the first leg of horse racing's Triple Crown.</p>","pub_date":"Mon, 22 June 2020 07:27:21 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab076"},"ISBN":1120,"title":"ESPY Award winners 2020: Full results, highlights, best moments from the ESPYs","author":"Tom Gatto","description":"<p>With major sports still on hold because COVID-19, this year's presentation focused on service to the community.</p>","pub_date":"Mon, 22 June 2020 07:26:58 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab077"},"ISBN":1121,"title":"LeBron James, Dale Earnhardt Jr. react to 'sickening' report of noose in Bubba Wallace's garage","author":"Tom Gatto","description":"<p>The NBA star and the NASCAR Hall of Famer showed their support for the lone Black driver in NASCAR's top series.</p>","pub_date":"Mon, 22 June 2020 14:39:26 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab078"},"ISBN":1122,"title":"NASCAR race weather updates: Rain in forecast threatens a second Talladega race delay","author":"Tadd Haislop","description":"<p>The NASCAR race at Talladega was postponed to Monday because of severe weather.</p>","pub_date":"Mon, 22 June 2020 12:58:31 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab079"},"ISBN":1123,"title":"NASCAR at Talladega: Rain, severe weather postpone the Geico 500 to Monday","author":"Tadd Haislop","description":"<p>Sunday's race at Talladega never had a chance to start. Due to severe weather, the Geico 500 was postponed to Monday.</p>","pub_date":"Mon, 22 June 2020 07:23:03 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab07a"},"ISBN":1124,"title":"NASCAR lineup at Talladega: Starting order, pole for Monday's postponed race without qualifying","author":"Tadd Haislop","description":"<p>The starting lineup and pole for Monday's NASCAR race at Talladega Superspeedway were set by a random draw. Here are the results.</p>","pub_date":"Mon, 22 June 2020 07:22:38 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab07b"},"ISBN":1125,"title":"NASCAR boss condemns the 'jackass' flying a Confederate flag over Talladega before Sunday's race","author":"Tadd Haislop","description":"<p>The banner flying over the track included the words \"Defund NASCAR.\"</p>","pub_date":"Mon, 22 June 2020 07:21:18 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab07c"},"ISBN":1126,"title":"What channel is NASCAR on Monday? TV schedule, start time for postponed Talladega race","author":"Tadd Haislop","description":"<p>Here's a complete guide to watching Monday's postponed NASCAR race at Talladega Superspeedway, including the TV channel and start time.</p>","pub_date":"Mon, 22 June 2020 07:20:38 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab07d"},"ISBN":1127,"title":"What time does the NASCAR race start Monday? Schedule, TV channel for postponed Talladega race","author":"Tadd Haislop","description":"<p>NASCAR continues its modified 2020 schedule Monday with a postponed race at Talladega Superspeedway. Here's everything to know about Sunday's race, including the start time and TV channel.</p>","pub_date":"Mon, 22 June 2020 07:20:53 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab07e"},"ISBN":1128,"title":"Video emerges of Eagles' Dallas Goedert getting sucker punched at restaurant","author":"Jordan Heck","description":"<p>Eagles tight end Dallas Goedert is reportedly \"fine\" after getting sucker punched.</p>","pub_date":"Sun, 21 June 2020 15:31:24 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab07f"},"ISBN":1129,"title":"Brett Favre compares Colin Kaepernick to Pat Tillman: 'We regard him as a hero'","author":"Jordan Heck","description":"<p>\"It's not easy for a guy his age ... to stop something that you've always dreamed of doing, and put it on hold, maybe forever, for something that you believe in.\"</p>","pub_date":"Sun, 21 June 2020 13:29:27 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab080"},"ISBN":1130,"title":"Rudy Gobert shares political post from wrong Serena Williams, gets roasted again","author":"Dan Bernstein","description":"<p>Gobert's rough 2020 hit another bump Saturday night.</p>","pub_date":"Sun, 21 June 2020 12:41:48 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab081"},"ISBN":1131,"title":"The Currys, Rivers, Thompsons and other famous NBA fathers and sons","author":"Mike DeCourcy","description":"<p>To celebrate Father’s Day, we look at a dozen of the most prominent active father-son duos (or trios, as the case may be).</p>","pub_date":"Sun, 21 June 2020 10:30:03 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab082"},"ISBN":1132,"title":"LSU players' COVID-19 quarantine reportedly result of outside contacts","author":"Tom Gatto","description":"<p>The university says its safety protocols are working but can't guard against interactions outside the football facility.</p>","pub_date":"Sun, 21 June 2020 10:05:59 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab083"},"ISBN":1133,"title":"Donald Trump campaign rally does not fill Tulsa arena, and Twitter has sports attendance jokes","author":"Tom Gatto","description":"<p>The BOK Center in Tulsa, Okla., seats about 19,000 people.</p>","pub_date":"Sun, 21 June 2020 09:02:37 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab084"},"ISBN":1134,"title":"Ken Griffey Jr. was just as 'cool' then as Patrick Mahomes is now","author":"Bill Bender","description":"<p>Ken Griffey Jr. was the coolest athlete of his generation, and it resembles the pull Patrick Mahomes II has on the NFL now.</p>","pub_date":"Sun, 21 June 2020 10:44:57 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab085"},"ISBN":1135,"title":"Odds for NASCAR race at Talladega: Expert picks & favorites to win Sunday's Cup Series race","author":"Tadd Haislop","description":"<p>Here are the complete odds to win Sunday's NASCAR Cup Series race at Talladega Superspeedway.</p>","pub_date":"Sun, 21 June 2020 18:16:38 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab086"},"ISBN":1136,"title":"New NASCAR rules package at Talladega: Explaining the changes after Ryan Newman's Daytona crash","author":"Tadd Haislop","description":"<p>NASCAR is trying to slow down the cars and prevent tandem drafting in an effort to avoid a Newman-like crash at Talladega.</p>","pub_date":"Sun, 21 June 2020 18:17:19 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab087"},"ISBN":1137,"title":"Jurgen Klopp: Not possible for Liverpool to replicate Manchester United's Premier League dominance","author":"Sporting News","description":"<p>The Reds boss can't see his side being as successful with competition between teams fiercer than ever</p>","pub_date":"Sun, 21 June 2020 00:31:37 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab088"},"ISBN":1138,"title":"Virgil van Dijk says Premier League title win can take some Liverpool players to 'next level'","author":"Sporting News","description":"<p>The Dutch defender believes more silverware is just what some of his teammates need to shine even brighter</p>","pub_date":"Sun, 21 June 2020 00:21:44 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab089"},"ISBN":1139,"title":"Cornerman defends ignoring Max Rohskopf's pleas to 'call' UFC fight","author":"Tom Gatto","description":"<p>Robert Drysdale didn't believe his \"champion\" fighter was hurt badly enough to stop the bout.</p>","pub_date":"Sat, 20 June 2020 23:05:02 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab08a"},"ISBN":1140,"title":"Nick Watney's contacts test negative; Justin Thomas calls Hilton Head an 'absolute zoo'","author":"Sporting News","description":"<p>\"No offense to Hilton Head, but they're seeming to not take it very seriously,\" Thomas said of people in the South Carolina ocean town.</p>","pub_date":"Sat, 20 June 2020 17:15:12 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab08b"},"ISBN":1141,"title":"Addison Russell could eventually win KBO MVP after getting contract in Korea","author":"Dan Bernstein","description":"<p>The Kiwoom Heroes reportedly signed Russell on Friday.</p>","pub_date":"Sat, 20 June 2020 14:27:54 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab08c"},"ISBN":1142,"title":"The Mannings, Longs, Shulas and other famous NFL fathers and sons, past and present","author":"Vinnie Iyer","description":"<p>The NFL has long been a family affair. Here are some of the father-son duos who have graced the gridiron.</p>","pub_date":"Sat, 20 June 2020 14:27:22 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab08d"},"ISBN":1143,"title":"Lakers owner Jeanie Buss shares vile racist letter addressed to her","author":"Joe Rivera","description":"<p>Buss called for her white friends to help fight against racism.</p>","pub_date":"Sat, 20 June 2020 13:40:48 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab08e"},"ISBN":1144,"title":"Premier League schedule: What games are on today? TV channels, times to watch EPL soccer in USA","author":"Sporting News","description":"<p>Here's everything you need to know about the return of the Premier League, including a full schedule for Matchday 30 and how to watch the matches in the United States.</p>","pub_date":"Sat, 20 June 2020 08:50:27 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab08f"},"ISBN":1145,"title":"How to watch Premier League in the USA: Full TV schedule for 2020 EPL season on NBC channels","author":"Sporting News","description":"<p>Here's a guide to watching Premier League soccer in the United States, including a complete schedule with start times and channels for the rest of the 2020 EPL season.</p>","pub_date":"Sat, 20 June 2020 08:50:39 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab090"},"ISBN":1146,"title":"What time is the Belmont Stakes? Post time, TV channel, horses & more to watch 2020 race","author":"Vinnie Iyer","description":"<p>Here is everything to know about the 2020 Belmont Stakes, including the post time, TV channel, odds and post positions for each horse.</p>","pub_date":"Sat, 20 June 2020 08:47:57 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab091"},"ISBN":1147,"title":"Belmont Stakes horses, odds, expert picks & more for first leg of 2020 Triple Crown","author":"Vinnie Iyer","description":"<p>Here's everything to know about the horses in the 2020 Belmont Stakes, including updated betting odds and picks from our expert.</p>","pub_date":"Sat, 20 June 2020 11:42:31 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab092"},"ISBN":1148,"title":"Belmont Stakes prop bets, odds and picks for the 2020 Triple Crown race","author":"Vinnie Iyer","description":"<p>Here's a complete guide to the 2020 Belmont Stakes prop bets, including odds and our picks for each.</p>","pub_date":"Sat, 20 June 2020 08:25:53 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab093"},"ISBN":1149,"title":"Belmont Stakes post positions: Full draw & odds for the 2020 Triple Crown race","author":"Tadd Haislop","description":"<p>Based on post positions for the 2020 Belmont Stakes, the favorite for Saturday's race is at a statistical disadvantage.</p>","pub_date":"Sat, 20 June 2020 08:25:26 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab094"},"ISBN":1150,"title":"Triple Crown schedule 2020: Here are new dates for the Kentucky Derby, Preakness, Belmont horse races","author":"Vinnie Iyer","description":"<p>The Triple Crown schedule for 2020 looks much different after postponements due to the COVID-19 pandemic.</p>","pub_date":"Sat, 20 June 2020 08:24:17 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab095"},"ISBN":1151,"title":"Belmont Stakes payout breakdown: How much prize money will the winner get in 2020?","author":"Dan Bernstein","description":"<p>While money is slightly tighter in 2020, the Belmont Stakes will still reward top finishers in a big way this year.</p>","pub_date":"Sat, 20 June 2020 08:24:32 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab096"},"ISBN":1152,"title":"23 Clemson football players test positive for COVID-19","author":"Sporting News","description":"<p>While there were 28 positive tests for coronavirus, Clemson said 23 of those were football players.</p>","pub_date":"Sat, 20 June 2020 00:46:43 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab097"},"ISBN":1153,"title":"Maybe Theo Epstein can help solve the Bears' kicker shortcomings","author":"Dan Bernstein","description":"<p>The Cubs president has a surprisingly strong leg.</p>","pub_date":"Fri, 19 June 2020 16:46:34 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab098"},"ISBN":1154,"title":"Lightning, Blue Jays halt training in Florida after multiple positive COVID-19 tests","author":"Tadd Haislop","description":"<p>The coronavirus outbreak in Florida apparently is impacting the sports world, too.</p>","pub_date":"Fri, 19 June 2020 15:37:09 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab099"},"ISBN":1155,"title":"How the NBA's seemingly helpful smart rings have complex implications for player rights","author":"Dan Bernstein","description":"<p>Athletes should use the introduction of the Oura ring as a chance to consider the future of wearable technology.</p>","pub_date":"Fri, 19 June 2020 15:32:42 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab09a"},"ISBN":1156,"title":"Former owners of Redskins, Twins have statues removed for racist history","author":"Sporting News","description":"<p>Statues of Calvin Griffith and George Preston Marshall have been removed from the grounds at Target Field and RFK Stadium.</p>","pub_date":"Fri, 19 June 2020 15:15:43 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab09b"},"ISBN":1157,"title":"Black Players Coalition of MLS forms as players unite to combat racism","author":"Sporting News","description":"<p>A group featuring players across the league have unified in an effort to address inequality in the sport</p>","pub_date":"Fri, 19 June 2020 14:30:26 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab09c"},"ISBN":1158,"title":"ESPN's Ryan Clark breaks down on 'Get Up' while discussing racism directed at his son","author":"Tadd Haislop","description":"<p>Jordan Clark and a couple Arizona State teammates said they were called the N-word by a Whataburger customer while waiting for their food.</p>","pub_date":"Fri, 19 June 2020 14:22:50 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab09d"},"ISBN":1159,"title":"Christian McCaffrey teams with dad to give Father's Day surprise to military members","author":"Bill Bender","description":"<p>Christian McCaffrey continues his work with USAA, and he gave a father-daughter military combo a Father's Day weekend surprise.</p>","pub_date":"Fri, 19 June 2020 11:15:56 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab09e"},"ISBN":1160,"title":"Mississippi State, Ole Miss support SEC pressure for a new state flag: 'It is past time for change'","author":"Tadd Haislop","description":"<p>The state flag of Mississippi is the only one in the United States that features the Confederate symbol.</p>","pub_date":"Fri, 19 June 2020 10:38:40 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab09f"},"ISBN":1161,"title":"Titus O'Neil on his Muhammad Ali Award nomination, addressing social issues in WWE and mission to give back","author":"Andreas Hale","description":"<p>WWE Superstar Titus O'Neil discusses being a finalist for the Muhammad Ali Award, Randy Orton coming around to support Black Lives Matter and why his job will never define who he is.</p>","pub_date":"Fri, 19 June 2020 10:33:59 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a0"},"ISBN":1162,"title":"Why Florida banned its 'Gator Bait' cheer amid movement against racial injustice","author":"Tadd Haislop","description":"<p>There is disturbing racist imagery associated with \"Gator Bait,\" school officials said in a letter banning the popular tradition at UF sporting events.</p>","pub_date":"Fri, 19 June 2020 11:22:35 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a1"},"ISBN":1163,"title":"From Blake Snell to Fay Vincent, those closest to MLB continue to misunderstand fans' relationship to game","author":"Mike DeCourcy","description":"<p>If MLB wishes to dismiss the threats from fans to abandon the game for good if there is no clear solution to the 2020 season, or no solution soon, it does so at its own peril.</p>","pub_date":"Fri, 19 June 2020 09:42:25 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a2"},"ISBN":1164,"title":"Donald Trump: Drew Brees 'caved under the PR pressure' by changing stance on kneeling","author":"Peter Hanson","description":"<p>Saints quarterback Drew Brees will come to regret his change of stance on kneeling during the national anthem, says Donald Trump.</p>","pub_date":"Fri, 19 June 2020 07:58:03 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a3"},"ISBN":1165,"title":"Mavericks owner Mark Cuban hopes NBA players are allowed to kneel during anthem","author":"Sporting News","description":"<p>NBA players should be allowed to kneel during the national anthem, Dallas Mavericks owner Mark Cuban said.</p>","pub_date":"Fri, 19 June 2020 07:55:57 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a4"},"ISBN":1166,"title":"Fortnite Catty Corner vault location: How to complete the Chapter 2, Season 3 challenge","author":"Joe Rivera","description":"<p>Here's everything to know about finding and opening the Catty Corner vault in Fortnite Chapter 2, Season 3.</p>","pub_date":"Fri, 19 June 2020 07:36:16 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a5"},"ISBN":1167,"title":"Where is Homely Hills in Fortnite? How to find gnomes in the Chapter 2, Season 3 map","author":"Joe Rivera","description":"<p>Here's a complete guide to Homely Hills in Fortnite, where you can find gnomes to complete the Chapter 2, Season 3 challenge.</p>","pub_date":"Fri, 19 June 2020 07:35:40 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a6"},"ISBN":1168,"title":"Fortnite map, Battle Pass, mythic weapons, Aquaman skin & more to know about Chapter 2, Season 3","author":"Jordan Heck","description":"<p>Here's a complete guide to the new Fortnite map, including how to get mythic weapons and the Aquaman skin, unlocking Battle Pass levels and more to master Chapter 2, Season 3.</p>","pub_date":"Fri, 19 June 2020 07:35:51 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a7"},"ISBN":1169,"title":"Fortnite has sharks you can ride and loot, here's how to do it","author":"Jordan Heck","description":"<p>You can ride sharks at the start of Fortnite Chapter 2, Season 3.</p>","pub_date":"Fri, 19 June 2020 07:35:28 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a8"},"ISBN":1170,"title":"Fortnite has cars in Chapter 2, Season 3, but where are they?","author":"Jordan Heck","description":"<p>The Fortnite Chapter 2, Season 3 trailer features cars, leading gamers to wonder if they can drive them.</p>","pub_date":"Fri, 19 June 2020 07:36:04 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0a9"},"ISBN":1171,"title":"When can Liverpool win the Premier League this season?","author":"Sporting News","description":"<p>The COVID-19 outbreak delayed Liverpool's Premier League celebrations, but with games restarting in June, when can they lift the title?</p>","pub_date":"Fri, 19 June 2020 07:30:32 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0aa"},"ISBN":1172,"title":"'Star Wars Squadrons' release details: Date, price, gameplay trailer for new EA title","author":"Dan Bernstein","description":"<p>EA created buzz with its announcement Thursday afternoon.</p>","pub_date":"Thu, 18 June 2020 20:32:41 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0ab"},"ISBN":1173,"title":"Jamal Adams sounds done with the Jets in Instagram post, reportedly requests trade","author":"Joe Rivera","description":"<p>The All-Pro safety had some more choice words for his organization on Thursday followed by a report that he has formally requested a trade out of New York.</p>","pub_date":"Thu, 18 June 2020 17:04:15 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0ac"},"ISBN":1174,"title":"Why 'Hard Knocks' in 2020 sounds like a bad idea, especially with boring Rams and Chargers","author":"Vinnie Iyer","description":"<p>Remaining hard-and-fast with \"Hard Knocks\" during a pandemic seems entirely NFL-serving and unnecessary.</p>","pub_date":"Thu, 18 June 2020 21:20:51 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0ad"},"ISBN":1175,"title":"Deebo Samuel injury update: 49ers offense takes a hit with WR's broken foot","author":"Tadd Haislop","description":"<p>The broken foot means Samuel likely will not be in the lineup when San Francisco begins its 2020 season.</p>","pub_date":"Thu, 18 June 2020 15:56:00 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0ae"},"ISBN":1176,"title":"Chief medical officer says NFL will be ‘flexible and adaptable’ after Anthony Fauci casts doubts over season","author":"Sporting News","description":"<p>NFL chief medical officer Dr. Allen Sills knows the league faces a tough task ensuring the season can start safely.</p>","pub_date":"Thu, 18 June 2020 15:15:22 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0af"},"ISBN":1177,"title":"Panthers prepared to get 'butts kicked' after offseason roster overhaul","author":"Dan Bernstein","description":"<p>Defensive coordinator Phil Snow set a low bar for the 2020 season.</p>","pub_date":"Thu, 18 June 2020 14:25:24 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b0"},"ISBN":1178,"title":"Texas linebacker: 'I do not feel comfortable' playing for Longhorns after speaking out on race","author":"Dan Bernstein","description":"<p>Juwan Mitchell said fans only care about on-field success and not the feelings of individuals who represent the Longhorns.</p>","pub_date":"Thu, 18 June 2020 13:57:28 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b1"},"ISBN":1179,"title":"Fact-checking Donald Trump's comments about Colin Kaepernick's NFL career","author":"Tadd Haislop","description":"<p>Trump was notably vague about how Kaepernick's career played out, so here is a quick refresher.</p>","pub_date":"Thu, 18 June 2020 12:22:13 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b2"},"ISBN":1180,"title":"Dominique Wilkins wants to make a comeback — as an All Elite Wrestling manager","author":"Joe Rivera","description":"<p>The \"Human Highlight Reel\" wants to take his talents from the court to the squared circle.</p>","pub_date":"Thu, 18 June 2020 11:30:47 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b3"},"ISBN":1181,"title":"Positive COVID-19 tests among Cowboys, Texans are giving NFL coaches pause on 2020 season","author":"Tadd Haislop","description":"<p>Training camp is right around the corner, and the clock is ticking for the NFL to establish comprehensive health and safety protocols.</p>","pub_date":"Thu, 18 June 2020 09:43:33 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b4"},"ISBN":1182,"title":"Madden 21 cover: The inside story on why EA Sports switched looks","author":"Jordan Heck","description":"<p>EA Sports wasn't able to do its typical cover shoot with Lamar Jackson, so designers had to get creative.</p>","pub_date":"Thu, 18 June 2020 07:48:08 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b5"},"ISBN":1183,"title":"Madden 21 release date, new features & more things we learned from EA Sports' reveal trailer","author":"Jordan Heck","description":"<p>EA Sports released the official Madden 21 gameplay trailer, our first look into what we can expect from the latest edition in video game franchise.</p>","pub_date":"Thu, 18 June 2020 07:47:50 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b6"},"ISBN":1184,"title":"Ex-NFL player repeats 31-year-old claim that Mike Gundy used N-word while playing for Oklahoma State","author":"Tom Gatto","description":"<p>Alfred Williams said he \"won't back down\" from speaking about what he said happened in 1989.</p>","pub_date":"Thu, 18 June 2020 07:31:20 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b7"},"ISBN":1185,"title":"The 100 most expensive football transfers of all time","author":"Sporting News","description":"<p>The big-money moves just keep on coming with Chelsea completing the signing of Timo Werner from RB Leipzig</p>","pub_date":"Thu, 18 June 2020 06:15:31 -0400"}
{"_id":{"$oid":"5ef151caa7ece36bd15ab0b8"},"ISBN":1186,"title":"Panthers ask, 'Who is the franchise GOAT?' Fans ask, 'Why isn't Cam Newton an option?'","author":"Tom Gatto","description":"<p>The team's former MVP and Super Bowl quarterback was conspicuous by his absence from the Twitter poll.</p>","pub_date":"Wed, 17 June 2020 22:25:33 -0400"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0b9"},"ISBN":1101,"title":"Inaugural copy of Dilith's Tamil newspaper handed to Ranil","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/1533cf553036bc2b990042891565662f_S.jpg\" alt=\"Inaugural copy of Dilith's Tamil newspaper handed to Ranil\" /></div><div class=\"K2FeedIntroText\"><p>Liberty Publishers, chaired by renowned businessman Dilith Jayaweera, today (22) launched a daily and weekly Tamil newspaper called \"Thamilan\".</p>\n</div><div class=\"K2FeedFullText\">\n<p>The inaugural issue was presented to former PM -&nbsp;Ranil Wickremesinghe while co-cabinet spokesman Dr. Bandula Gunawardena, former ministers Rauff Hakeem, Ravi Karunanayake and Sarath Amunugama were among the attendees at the launch.</p>\n<p>Addressing the launch, Mr. R. Sivarajah, who is the editor of the newspaper, said that the publication did not have any hidden political agenda and this was apparent in the maiden issue.</p>\n<p>Popular newspapers 'Aruna' and 'The Morning' are also published by Liberty Publishers.</p></div>","pub_date":"Mon, 22 Jun 2020 16:26:25 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0ba"},"ISBN":1102,"title":"South Korea confirms 2nd wave of coronavirus","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/57d2dfeda4c13c0d37704088af3e63c0_S.jpg\" alt=\"South Korea confirms 2nd wave of coronavirus\" /></div><div class=\"K2FeedIntroText\"><p>Health officials in South Korea believe the country is going through a second wave of coronavirus, despite recording relatively low numbers.</p>\n</div><div class=\"K2FeedFullText\">\n<p>The country had been a success story in dealing with Covid-19, but now expects the pandemic to continue for months.</p>\n<p>Head of the Korea Centers for Disease Control (KCDC), Jung Eun-kyeong, said the first wave lasted up until April.</p>\n<p>Yet since May, clusters of new cases have grown, including outbreaks at nightclubs in the capital, Seoul.</p>\n<p>Between those periods, daily confirmed cases had fallen from nearly a thousand to zero infections recorded for three days in a row.</p>\n<p>Officials on Monday said that over the last 24 hours, 17 new infections had been recorded, from different clusters in large offices and warehouses.</p>\n<p>Dr Jeong said the recent resurgence had led her to conclude that the country was in the grip of a second wave of the virus, and that she expected it to continue.</p>\n<p>Until now, the KCDC had said that South Korea's first wave had never really ended.</p>\n<p>But Dr Jeong said it was now clear that a holiday weekend in early May marked the beginning of a new wave of infections focused in the greater Seoul area, which had previously seen only a few cases.</p>\n<p><strong>(BBC News)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 16:16:23 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0bb"},"ISBN":1103,"title":"4 acquitted in ‘Ali Roshan’ elephant case","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/cd4a2d95097d290d0b6463d92720a004_S.jpg\" alt=\"4 acquitted in ‘Ali Roshan’ elephant case\" /></div><div class=\"K2FeedIntroText\"><p>Four out of the eight defendants charged in the case over the illegal possession of five elephants were acquitted and released today.</p>\n</div><div class=\"K2FeedFullText\">\n<p>The four individuals were acquitted by the Special High Court Trial- at- Bar when the case was taken up for hearing this morning.</p>\n<p>The Attorney General filed indictments against elephant trafficking kingpin Samarappulige Niraj Roshan alias ‘Ali Roshan’ and seven others for unlawful possession of five elephants valued at Rs.30 million.</p>\n<p>The eight suspects, including Ali Roshan, were arrested for the possession without valid permits and racketeering of 5 elephant calves between June 2012 – August 2015.</p>\n<p>The suspects have been charged with 36 counts of possessing public property.&nbsp;</p>\n<p><strong>(colombogazette.com)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 15:29:11 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0bc"},"ISBN":1104,"title":"The 'Undertaker' bows out from the ring","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/834ad7ef3de207b4ccf2be3e08758c63_S.jpg\" alt=\"The 'Undertaker' bows out from the ring\" /></div><div class=\"K2FeedIntroText\"><p>The Undertaker, one of World Wrestling Entertainment's (WWE) most iconic wrestling superstar and entertainer par excellence to have ever graced the sports entertainment industry, pulled down the curtains on a glittering career which spanned over 3 decades with the WWE.</p>\n</div><div class=\"K2FeedFullText\">\n<p>Billed as the 'Undertaker' by the WWE, Mark Calaway, confirmed his retirement by stating that he was done with wrestling during the final episode of his docuseries “Undertaker: The Last Ride,” saying he is content not stepping in the ring again.</p>\n<p>“Never say never, but at this point in my life and in my career, I have no desire to get back in the ring. I’m at a point, it’s time this cowboy really rides away,” he said during the fifth and final episode of the docuseries. “There’s nothing left for me to conquer. There’s nothing left for me to accomplish. The game has changed. It’s time for new guys to come up. The time just seems right. I think this documentary has helped me discover that. It’s really opened my eyes to the bigger picture,” he said.</p>\n<p>Following the release of the final episode, WWE also posted an epic tweet which pretty much confirmed the Undertaker's retirement. The tweet had many iconic photos that highlighted all the important stages of The Undertaker's legendary career. The tweet was accompanied by the caption '#ThankYouTaker for'.</p>\n<p><strong>(Excerpts : Sportskeeda)</strong></p>\n<p><img style=\"display: block; margin: 2px auto;\" src=\"https://srilankamirror.com/images/1_image_gallery/world/2020/06_June/Taker1_670px_20_06_22.jpg\" alt=\"Taker1 670px 20 06 22\" width=\"800\" height=\"1000\" /></p></div>","pub_date":"Mon, 22 Jun 2020 14:42:38 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0bd"},"ISBN":1105,"title":"No injunction order against UNP decision","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/2b8b080fb0d365eb5a74b4958a029bd0_S.jpg\" alt=\"No injunction order against UNP decision\" /></div><div class=\"K2FeedIntroText\"><p>The Colombo District Court today (22) refused to issue an injunction order on the decision of the United National Party (UNP) to suspend the memberships of 99 party members.</p>\n</div><div class=\"K2FeedFullText\">\n<p>Colombo District Court Judge Amali Ranaweera rejected the request after taking up the petition filed by former MP Ranjith Madduma Bandara, who is the&nbsp;General Secretary of Samagi Jana Balawegaya (SJB).</p>\n<p>Madduma Bandara had sought an injunction preventing the UNP from suspending the party membership of 99 members.</p>\n<p>Colombo District Judge Amali Ranaweera adjourned the case until the 27th of July and issued notice to the respondents cited in the petition.</p></div>","pub_date":"Mon, 22 Jun 2020 12:16:50 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0be"},"ISBN":1106,"title":"NEC opposes Maithri's plans?","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/acbb11a5d3f412d4459390291d5f3b24_S.jpg\" alt=\"NEC opposes Maithri's plans?\" /></div><div class=\"K2FeedIntroText\"><p>Former President Maithripala Sirisena says that he even had to deprive several retired government officials of their tea and refreshments after a complaint was lodged with the National Election Commission (NEC).</p>\n</div><div class=\"K2FeedFullText\">\n<p>Mr. Sirisena said that he met with a group of&nbsp;retired government officials in Polonnaruwa at the Araliya Hotel, last week, as a part of his political campaign.</p>\n<div>Speaking later in Polonnaruwa, he said that he is committed to resolving issues of pensioners and would give the matter prominence after the election.&nbsp;</div>\n<div>&nbsp;</div>\n<div>\"I also have to mention something regrettable. Earlier this morning, officials of the NEC asked whether the attendees&nbsp;of the meeting will be provided refreshments. I said that we will be providing them food as some will come from far away. Then they said refreshments cannot be allowed. They asked whether bribes will be given afterwards. I staunchly said that I have never given bribes and I never will. However, I feel bad about not being able to at least serve a cup of tea. An official of the regional election office had even told not to hold the meeting at the Araliya Hotel. But I contacted the chairman of the NEC and he said there was no objection to holding such meetings in a hotel hall. I regret this very much. Someone has phoned election officers and complained that it was illegal for me to offer refreshments to my supporters. Such things have never happened in this country before. I regret that you had to leave Araliya hotel even without having a cup of tea,\" he had said.</div>\n<div>\n<div>\n<div><br />NEC officials have canceled two programs organized by the former president.<br /><br />A few days ago, the NEC had also suspended a programme by Mr. Sirisena to&nbsp;award gifts to university students.</div>\n</div>\n</div></div>","pub_date":"Mon, 22 Jun 2020 11:21:18 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0bf"},"ISBN":1107,"title":"CID orders to launch probe on Karuna Amman’s statement","author":"editor@srilankamirror.com (kelum)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/bdad17ef956e897f0d07adb28740ab41_S.jpg\" alt=\"CID orders to launch probe on Karuna Amman’s statement\" /></div><div class=\"K2FeedIntroText\"><p>Acting IGP ordered the Criminal Investigation Department (CID) to immediately launch an investigation into the statement made by former Deputy Minister Vinyagamoorthy Muralitharan alias Karuna Amman, Police Spokesman Jaliya Senaratne said.</p>\n</div><div class=\"K2FeedFullText\">\n<p>He said the CID will launch a probe over Karuna Amman’s statement which he claimed to have committed crimes when he was in the LTTE.</p>\n<p>“When I was a member of the LTTE, I killed some 2000 to 3000 Sri Lankan army personnel in one night at Elephant Pass. I have killed more in Killinochchi. That is certainly higher than the number of lives the coronavirus has claimed in Sri Lanka,” Karuna said addressing a gathering in Navadinveli, Ampara recently.</p>\n<p><strong>(dailymirror)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 10:55:30 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0c0"},"ISBN":1108,"title":"Won't change statement - Karuna","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/a2a87239b8730af39cb9015665a92168_S.jpg\" alt=\"Won't change statement - Karuna\" /></div><div class=\"K2FeedIntroText\"><p>Former LTTE regional leader - Vinayagamoorthy Muralitharan better known as Karuna Amman says it is common knowledge that he killed soldiers while in the LTTE and it is not possible to arrest him now over that fact.</p>\n</div><div class=\"K2FeedFullText\">\n<p>Muralitharan, who is contesting the upcoming Gen. election from the Ampara district, sparked controversy last week after saying that he is more dangerous than COVID-19 as he killed between 2000-3000 troops in a single day at Elephant Pass during the war.</p>\n<div>Noting that he stood by his&nbsp;original statement, he added that&nbsp; although the United National Party and the Janatha Vimukthi Party called to arrest him, they too had wrongs in their pasts.</div>\n<div>&nbsp;</div>\n<div><span style=\"color: #0000ff;\"><strong>Taken out of context</strong></span></div>\n<div>&nbsp;</div>\n<div>Speaking to 'Daily Mirror', he has said that the UNP and JVP had taken his statement out of context.</div>\n<div><br />\"My statement has been taken out of context. What I meant is that during the war, both the army and the LTTE suffered heavy casualties. However, under Mahinda Rajapaksa’s leadership peace was brought in. So I was referring to the lives lost,” Muralitharan said.&nbsp; &nbsp;</div>\n<div><br />Referring to Sajith rebuking his statement, Muralitharan said,&nbsp; “Sajith very well knows that his father had given 5,000 rifles and 1 crore rounds when LTTE was very weak. The UNP people only supplied the weapons rounds.”<br /><br />“At the same time, Anura Kumara Dissanayake cannot blame me because they killed more than 80,000 people. So they cannot talk like that against me,” he added. &nbsp;<br /><br />He emphasises that he has joined a democratic political process now.</div>\n<div>&nbsp;</div>\n<p><iframe title=\"vimeo-player\" src=\"https://player.vimeo.com/video/431321479\" width=\"“100%&quot;\" height=\"360\" allowfullscreen=\"\"></iframe></p>\n<div><strong><span style=\"color: #993300;\">Muralitharan's statement (Courtesy : News First)&nbsp;</span></strong><br /><br />Muralitharan had backed the incumbent president Gotabhaya Rajapaksa during the last presidential election.</div>\n<div><br /><span style=\"color: #0000ff;\"><strong>Political prisoners</strong></span></div>\n<div>&nbsp;</div>\n<div>However, the media had reported that requests made by several Tamil politicians to release 84 political prisoners related to LTTE activities, were declined on the grounds that the prisoners were&nbsp;convicted of missile strikes on airplanes and killing security force personnel.</div>\n<p>Tamil politicians including former Chief Minister of the Northern Provincial Council - C.V. Vigneswaran, EPRLF leader - S. Premachandra, N. Srikanthan and Anandi Sasitharan had made the above request.</p>\n<div>They have also asked president Gotabhaya Rajapaksa to extend a presidential pardon to them, reports say.<br /><br /><strong>(Sources - Aruna / Dailymirror)</strong></div>\n<div>&nbsp;</div>\n<div><strong>Related News :&nbsp;</strong></div>\n<div>&nbsp;</div>\n<div><span style=\"color: #993300;\"><a style=\"color: #993300;\" href=\"https://srilankamirror.com/news/18614-karuna-s-recent-statement-severely-criticised\" target=\"_blank\" rel=\"noopener\">Karuna's recent statement severely criticised</a></span></div></div>","pub_date":"Mon, 22 Jun 2020 10:43:13 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0c1"},"ISBN":1109,"title":"2 prison guards interdicted over phones ","author":"editor@srilankamirror.com (kelum)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/1917cb1f37469769cba865c3f448db35_S.jpg\" alt=\"2 prison guards interdicted over phones \" /></div><div class=\"K2FeedIntroText\"><p>Two prison guards have been interdicted and handed over to the Police for providing mobile phones to inmates, Prisons sources said.</p>\n</div><div class=\"K2FeedFullText\">\n<p>The two prison guards were attached to the Mahara and Matara Prisons. Meanwhile, an investigation has been launched over the detection of a mobile phone in the hands of another prison inmate at the Negombo Prison.&nbsp;</p>\n<p>The mobile phones had been provided by prison guards to drug convicts at the Mahara, Matara and Negombo prisons.</p>\n<p>The Prisons Department has launched a major clean-up operation following the appointment of the new Commissioner General of Prisons last week. The President had issued orders to clean-up the prisons and stop the drug operations and corruption taking place from within prisons.</p>\n<p>The Defence Secretary last week accused the majority of prison officials of being corrupt and called on the prison authorities to get their act together.</p>\n<p><strong>(dailynews.lk)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 09:49:40 +0530"}
{"_id":{"$oid":"5ef151eaa7ece36bd15ab0c2"},"ISBN":1110,"title":"Govt. politicizing independent commissions - Ranil","author":"editor@srilankamirror.com (kelum)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/e581ad3c209076dd1b652e0d2b8eb392_S.jpg\" alt=\"Govt. politicizing independent commissions - Ranil\" /></div><div class=\"K2FeedIntroText\"><p>United National Party (UNP) leader Ranil Wickremesinghe on Sunday accused the government of tarnishing the independent nature of commissions.</p>\n</div><div class=\"K2FeedFullText\">\n<p>“Look at the manner in which they are scolding the members of the election commission,” Wickremesinghe told a meeting with the lawyers association of his party.</p>\n<p>He claimed that several police officers have been transferred by the National Police Commission that has now become politicized.</p>\n<p>“The freedom of state employees must be protected,” the UNP leader insisted.</p>\n<p>He pointed out that the previous government, in which he was Prime Minister, had not sidelined state employees who did not support them.</p>\n<p>The UNP leader said that democratic rights are diminishing gradually as state employees are being scolded in public while the police service has become politicized.</p>\n<p><strong>(newsfirst.lk)</strong></p>\n<p><strong>(Except for the headline, this story, originally published by newsfirst.lk has not been edited by SLM staff)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 09:36:12 +0530"}
{"_id":{"$oid":"5ef15215a7ece36bd15ab0c3"},"ISBN":"11456","title":"Tes book","author":"Test author","description":"test description","pub_date":"2020-06-23"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0c4"},"ISBN":1101,"title":"Inaugural copy of Dilith's Tamil newspaper handed to Ranil","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/1533cf553036bc2b990042891565662f_S.jpg\" alt=\"Inaugural copy of Dilith's Tamil newspaper handed to Ranil\" /></div><div class=\"K2FeedIntroText\"><p>Liberty Publishers, chaired by renowned businessman Dilith Jayaweera, today (22) launched a daily and weekly Tamil newspaper called \"Thamilan\".</p>\n</div><div class=\"K2FeedFullText\">\n<p>The inaugural issue was presented to former PM -&nbsp;Ranil Wickremesinghe while co-cabinet spokesman Dr. Bandula Gunawardena, former ministers Rauff Hakeem, Ravi Karunanayake and Sarath Amunugama were among the attendees at the launch.</p>\n<p>Addressing the launch, Mr. R. Sivarajah, who is the editor of the newspaper, said that the publication did not have any hidden political agenda and this was apparent in the maiden issue.</p>\n<p>Popular newspapers 'Aruna' and 'The Morning' are also published by Liberty Publishers.</p></div>","pub_date":"Mon, 22 Jun 2020 16:26:25 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0c5"},"ISBN":1102,"title":"South Korea confirms 2nd wave of coronavirus","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/57d2dfeda4c13c0d37704088af3e63c0_S.jpg\" alt=\"South Korea confirms 2nd wave of coronavirus\" /></div><div class=\"K2FeedIntroText\"><p>Health officials in South Korea believe the country is going through a second wave of coronavirus, despite recording relatively low numbers.</p>\n</div><div class=\"K2FeedFullText\">\n<p>The country had been a success story in dealing with Covid-19, but now expects the pandemic to continue for months.</p>\n<p>Head of the Korea Centers for Disease Control (KCDC), Jung Eun-kyeong, said the first wave lasted up until April.</p>\n<p>Yet since May, clusters of new cases have grown, including outbreaks at nightclubs in the capital, Seoul.</p>\n<p>Between those periods, daily confirmed cases had fallen from nearly a thousand to zero infections recorded for three days in a row.</p>\n<p>Officials on Monday said that over the last 24 hours, 17 new infections had been recorded, from different clusters in large offices and warehouses.</p>\n<p>Dr Jeong said the recent resurgence had led her to conclude that the country was in the grip of a second wave of the virus, and that she expected it to continue.</p>\n<p>Until now, the KCDC had said that South Korea's first wave had never really ended.</p>\n<p>But Dr Jeong said it was now clear that a holiday weekend in early May marked the beginning of a new wave of infections focused in the greater Seoul area, which had previously seen only a few cases.</p>\n<p><strong>(BBC News)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 16:16:23 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0c6"},"ISBN":1103,"title":"4 acquitted in ‘Ali Roshan’ elephant case","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/cd4a2d95097d290d0b6463d92720a004_S.jpg\" alt=\"4 acquitted in ‘Ali Roshan’ elephant case\" /></div><div class=\"K2FeedIntroText\"><p>Four out of the eight defendants charged in the case over the illegal possession of five elephants were acquitted and released today.</p>\n</div><div class=\"K2FeedFullText\">\n<p>The four individuals were acquitted by the Special High Court Trial- at- Bar when the case was taken up for hearing this morning.</p>\n<p>The Attorney General filed indictments against elephant trafficking kingpin Samarappulige Niraj Roshan alias ‘Ali Roshan’ and seven others for unlawful possession of five elephants valued at Rs.30 million.</p>\n<p>The eight suspects, including Ali Roshan, were arrested for the possession without valid permits and racketeering of 5 elephant calves between June 2012 – August 2015.</p>\n<p>The suspects have been charged with 36 counts of possessing public property.&nbsp;</p>\n<p><strong>(colombogazette.com)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 15:29:11 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0c7"},"ISBN":1104,"title":"The 'Undertaker' bows out from the ring","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/834ad7ef3de207b4ccf2be3e08758c63_S.jpg\" alt=\"The 'Undertaker' bows out from the ring\" /></div><div class=\"K2FeedIntroText\"><p>The Undertaker, one of World Wrestling Entertainment's (WWE) most iconic wrestling superstar and entertainer par excellence to have ever graced the sports entertainment industry, pulled down the curtains on a glittering career which spanned over 3 decades with the WWE.</p>\n</div><div class=\"K2FeedFullText\">\n<p>Billed as the 'Undertaker' by the WWE, Mark Calaway, confirmed his retirement by stating that he was done with wrestling during the final episode of his docuseries “Undertaker: The Last Ride,” saying he is content not stepping in the ring again.</p>\n<p>“Never say never, but at this point in my life and in my career, I have no desire to get back in the ring. I’m at a point, it’s time this cowboy really rides away,” he said during the fifth and final episode of the docuseries. “There’s nothing left for me to conquer. There’s nothing left for me to accomplish. The game has changed. It’s time for new guys to come up. The time just seems right. I think this documentary has helped me discover that. It’s really opened my eyes to the bigger picture,” he said.</p>\n<p>Following the release of the final episode, WWE also posted an epic tweet which pretty much confirmed the Undertaker's retirement. The tweet had many iconic photos that highlighted all the important stages of The Undertaker's legendary career. The tweet was accompanied by the caption '#ThankYouTaker for'.</p>\n<p><strong>(Excerpts : Sportskeeda)</strong></p>\n<p><img style=\"display: block; margin: 2px auto;\" src=\"https://srilankamirror.com/images/1_image_gallery/world/2020/06_June/Taker1_670px_20_06_22.jpg\" alt=\"Taker1 670px 20 06 22\" width=\"800\" height=\"1000\" /></p></div>","pub_date":"Mon, 22 Jun 2020 14:42:38 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0c8"},"ISBN":1105,"title":"No injunction order against UNP decision","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/2b8b080fb0d365eb5a74b4958a029bd0_S.jpg\" alt=\"No injunction order against UNP decision\" /></div><div class=\"K2FeedIntroText\"><p>The Colombo District Court today (22) refused to issue an injunction order on the decision of the United National Party (UNP) to suspend the memberships of 99 party members.</p>\n</div><div class=\"K2FeedFullText\">\n<p>Colombo District Court Judge Amali Ranaweera rejected the request after taking up the petition filed by former MP Ranjith Madduma Bandara, who is the&nbsp;General Secretary of Samagi Jana Balawegaya (SJB).</p>\n<p>Madduma Bandara had sought an injunction preventing the UNP from suspending the party membership of 99 members.</p>\n<p>Colombo District Judge Amali Ranaweera adjourned the case until the 27th of July and issued notice to the respondents cited in the petition.</p></div>","pub_date":"Mon, 22 Jun 2020 12:16:50 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0c9"},"ISBN":1106,"title":"NEC opposes Maithri's plans?","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/acbb11a5d3f412d4459390291d5f3b24_S.jpg\" alt=\"NEC opposes Maithri's plans?\" /></div><div class=\"K2FeedIntroText\"><p>Former President Maithripala Sirisena says that he even had to deprive several retired government officials of their tea and refreshments after a complaint was lodged with the National Election Commission (NEC).</p>\n</div><div class=\"K2FeedFullText\">\n<p>Mr. Sirisena said that he met with a group of&nbsp;retired government officials in Polonnaruwa at the Araliya Hotel, last week, as a part of his political campaign.</p>\n<div>Speaking later in Polonnaruwa, he said that he is committed to resolving issues of pensioners and would give the matter prominence after the election.&nbsp;</div>\n<div>&nbsp;</div>\n<div>\"I also have to mention something regrettable. Earlier this morning, officials of the NEC asked whether the attendees&nbsp;of the meeting will be provided refreshments. I said that we will be providing them food as some will come from far away. Then they said refreshments cannot be allowed. They asked whether bribes will be given afterwards. I staunchly said that I have never given bribes and I never will. However, I feel bad about not being able to at least serve a cup of tea. An official of the regional election office had even told not to hold the meeting at the Araliya Hotel. But I contacted the chairman of the NEC and he said there was no objection to holding such meetings in a hotel hall. I regret this very much. Someone has phoned election officers and complained that it was illegal for me to offer refreshments to my supporters. Such things have never happened in this country before. I regret that you had to leave Araliya hotel even without having a cup of tea,\" he had said.</div>\n<div>\n<div>\n<div><br />NEC officials have canceled two programs organized by the former president.<br /><br />A few days ago, the NEC had also suspended a programme by Mr. Sirisena to&nbsp;award gifts to university students.</div>\n</div>\n</div></div>","pub_date":"Mon, 22 Jun 2020 11:21:18 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0ca"},"ISBN":1107,"title":"CID orders to launch probe on Karuna Amman’s statement","author":"editor@srilankamirror.com (kelum)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/bdad17ef956e897f0d07adb28740ab41_S.jpg\" alt=\"CID orders to launch probe on Karuna Amman’s statement\" /></div><div class=\"K2FeedIntroText\"><p>Acting IGP ordered the Criminal Investigation Department (CID) to immediately launch an investigation into the statement made by former Deputy Minister Vinyagamoorthy Muralitharan alias Karuna Amman, Police Spokesman Jaliya Senaratne said.</p>\n</div><div class=\"K2FeedFullText\">\n<p>He said the CID will launch a probe over Karuna Amman’s statement which he claimed to have committed crimes when he was in the LTTE.</p>\n<p>“When I was a member of the LTTE, I killed some 2000 to 3000 Sri Lankan army personnel in one night at Elephant Pass. I have killed more in Killinochchi. That is certainly higher than the number of lives the coronavirus has claimed in Sri Lanka,” Karuna said addressing a gathering in Navadinveli, Ampara recently.</p>\n<p><strong>(dailymirror)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 10:55:30 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0cb"},"ISBN":1108,"title":"Won't change statement - Karuna","author":"editor@srilankamirror.com (tharindu)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/a2a87239b8730af39cb9015665a92168_S.jpg\" alt=\"Won't change statement - Karuna\" /></div><div class=\"K2FeedIntroText\"><p>Former LTTE regional leader - Vinayagamoorthy Muralitharan better known as Karuna Amman says it is common knowledge that he killed soldiers while in the LTTE and it is not possible to arrest him now over that fact.</p>\n</div><div class=\"K2FeedFullText\">\n<p>Muralitharan, who is contesting the upcoming Gen. election from the Ampara district, sparked controversy last week after saying that he is more dangerous than COVID-19 as he killed between 2000-3000 troops in a single day at Elephant Pass during the war.</p>\n<div>Noting that he stood by his&nbsp;original statement, he added that&nbsp; although the United National Party and the Janatha Vimukthi Party called to arrest him, they too had wrongs in their pasts.</div>\n<div>&nbsp;</div>\n<div><span style=\"color: #0000ff;\"><strong>Taken out of context</strong></span></div>\n<div>&nbsp;</div>\n<div>Speaking to 'Daily Mirror', he has said that the UNP and JVP had taken his statement out of context.</div>\n<div><br />\"My statement has been taken out of context. What I meant is that during the war, both the army and the LTTE suffered heavy casualties. However, under Mahinda Rajapaksa’s leadership peace was brought in. So I was referring to the lives lost,” Muralitharan said.&nbsp; &nbsp;</div>\n<div><br />Referring to Sajith rebuking his statement, Muralitharan said,&nbsp; “Sajith very well knows that his father had given 5,000 rifles and 1 crore rounds when LTTE was very weak. The UNP people only supplied the weapons rounds.”<br /><br />“At the same time, Anura Kumara Dissanayake cannot blame me because they killed more than 80,000 people. So they cannot talk like that against me,” he added. &nbsp;<br /><br />He emphasises that he has joined a democratic political process now.</div>\n<div>&nbsp;</div>\n<p><iframe title=\"vimeo-player\" src=\"https://player.vimeo.com/video/431321479\" width=\"“100%&quot;\" height=\"360\" allowfullscreen=\"\"></iframe></p>\n<div><strong><span style=\"color: #993300;\">Muralitharan's statement (Courtesy : News First)&nbsp;</span></strong><br /><br />Muralitharan had backed the incumbent president Gotabhaya Rajapaksa during the last presidential election.</div>\n<div><br /><span style=\"color: #0000ff;\"><strong>Political prisoners</strong></span></div>\n<div>&nbsp;</div>\n<div>However, the media had reported that requests made by several Tamil politicians to release 84 political prisoners related to LTTE activities, were declined on the grounds that the prisoners were&nbsp;convicted of missile strikes on airplanes and killing security force personnel.</div>\n<p>Tamil politicians including former Chief Minister of the Northern Provincial Council - C.V. Vigneswaran, EPRLF leader - S. Premachandra, N. Srikanthan and Anandi Sasitharan had made the above request.</p>\n<div>They have also asked president Gotabhaya Rajapaksa to extend a presidential pardon to them, reports say.<br /><br /><strong>(Sources - Aruna / Dailymirror)</strong></div>\n<div>&nbsp;</div>\n<div><strong>Related News :&nbsp;</strong></div>\n<div>&nbsp;</div>\n<div><span style=\"color: #993300;\"><a style=\"color: #993300;\" href=\"https://srilankamirror.com/news/18614-karuna-s-recent-statement-severely-criticised\" target=\"_blank\" rel=\"noopener\">Karuna's recent statement severely criticised</a></span></div></div>","pub_date":"Mon, 22 Jun 2020 10:43:13 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0cc"},"ISBN":1109,"title":"2 prison guards interdicted over phones ","author":"editor@srilankamirror.com (kelum)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/1917cb1f37469769cba865c3f448db35_S.jpg\" alt=\"2 prison guards interdicted over phones \" /></div><div class=\"K2FeedIntroText\"><p>Two prison guards have been interdicted and handed over to the Police for providing mobile phones to inmates, Prisons sources said.</p>\n</div><div class=\"K2FeedFullText\">\n<p>The two prison guards were attached to the Mahara and Matara Prisons. Meanwhile, an investigation has been launched over the detection of a mobile phone in the hands of another prison inmate at the Negombo Prison.&nbsp;</p>\n<p>The mobile phones had been provided by prison guards to drug convicts at the Mahara, Matara and Negombo prisons.</p>\n<p>The Prisons Department has launched a major clean-up operation following the appointment of the new Commissioner General of Prisons last week. The President had issued orders to clean-up the prisons and stop the drug operations and corruption taking place from within prisons.</p>\n<p>The Defence Secretary last week accused the majority of prison officials of being corrupt and called on the prison authorities to get their act together.</p>\n<p><strong>(dailynews.lk)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 09:49:40 +0530"}
{"_id":{"$oid":"5ef153eba7ece36bd15ab0cd"},"ISBN":1110,"title":"Govt. politicizing independent commissions - Ranil","author":"editor@srilankamirror.com (kelum)","description":"<div class=\"K2FeedImage\"><img src=\"https://srilankamirror.com/media/k2/items/cache/e581ad3c209076dd1b652e0d2b8eb392_S.jpg\" alt=\"Govt. politicizing independent commissions - Ranil\" /></div><div class=\"K2FeedIntroText\"><p>United National Party (UNP) leader Ranil Wickremesinghe on Sunday accused the government of tarnishing the independent nature of commissions.</p>\n</div><div class=\"K2FeedFullText\">\n<p>“Look at the manner in which they are scolding the members of the election commission,” Wickremesinghe told a meeting with the lawyers association of his party.</p>\n<p>He claimed that several police officers have been transferred by the National Police Commission that has now become politicized.</p>\n<p>“The freedom of state employees must be protected,” the UNP leader insisted.</p>\n<p>He pointed out that the previous government, in which he was Prime Minister, had not sidelined state employees who did not support them.</p>\n<p>The UNP leader said that democratic rights are diminishing gradually as state employees are being scolded in public while the police service has become politicized.</p>\n<p><strong>(newsfirst.lk)</strong></p>\n<p><strong>(Except for the headline, this story, originally published by newsfirst.lk has not been edited by SLM staff)</strong></p></div>","pub_date":"Mon, 22 Jun 2020 09:36:12 +0530"}
